using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;
using System.Threading.Tasks;

namespace PMLabs
{
    class Dom
    {
        public static int vertexCount = 36;

        public static float[] vertices ={
            // Przednia ściana
            -0.75f, -0.5f, 0.5f, 1.0f,
            0.75f, -0.5f, 0.5f, 1.0f,
            0.75f, 0.5f, 0.5f, 1.0f,

            -0.75f, -0.5f, 0.5f, 1.0f,
            0.75f, 0.5f, 0.5f, 1.0f,
            -0.75f, 0.5f, 0.5f, 1.0f,

            // Tylna ściana
            -0.75f, -0.5f, -0.5f, 1.0f,
            0.75f, -0.5f, -0.5f, 1.0f,
            0.75f, 0.5f, -0.5f, 1.0f,

            -0.75f, -0.5f, -0.5f, 1.0f,
            0.75f, 0.5f, -0.5f, 1.0f,
            -0.75f, 0.5f, -0.5f, 1.0f,

            // Lewa ściana
            -0.75f, -0.5f, -0.5f, 1.0f,
            -0.75f, -0.5f, 0.5f, 1.0f,
            -0.75f, 0.5f, 0.5f, 1.0f,

            -0.75f, -0.5f, -0.5f, 1.0f,
            -0.75f, 0.5f, 0.5f, 1.0f,
            -0.75f, 0.5f, -0.5f, 1.0f,

            // Prawa ściana
            0.75f, -0.5f, -0.5f, 1.0f,
            0.75f, -0.5f, 0.5f, 1.0f,
            0.75f, 0.5f, 0.5f, 1.0f,

            0.75f, -0.5f, -0.5f, 1.0f,
            0.75f, 0.5f, 0.5f, 1.0f,
            0.75f, 0.5f, -0.5f, 1.0f,

            // Dolna ściana
            -0.75f, -0.5f, -0.5f, 1.0f,
            0.75f, -0.5f, -0.5f, 1.0f,
            0.75f, -0.5f, 0.5f, 1.0f,

            -0.75f, -0.5f, -0.5f, 1.0f,
            0.75f, -0.5f, 0.5f, 1.0f,
            -0.75f, -0.5f, 0.5f, 1.0f,

            // Górna ściana
            -0.75f, 0.5f, -0.5f, 1.0f,
            0.75f, 0.5f, -0.5f, 1.0f,
            0.75f, 0.5f, 0.5f, 1.0f,

            -0.75f, 0.5f, -0.5f, 1.0f,
            0.75f, 0.5f, 0.5f, 1.0f,
            -0.75f, 0.5f, 0.5f, 1.0f
            };


        public static float[] colors ={
                1.0f, 0.0f, 0.0f, 1.0f, // Przednia ściana
                1.0f, 0.0f, 0.0f, 1.0f,
                1.0f, 0.0f, 0.0f, 1.0f,

                1.0f, 0.0f, 0.0f, 1.0f, // Tylna ściana
                1.0f, 0.0f, 0.0f, 1.0f,
                1.0f, 0.0f, 0.0f, 1.0f,

                0.0f, 1.0f, 0.0f, 1.0f, // Lewa ściana
                0.0f, 1.0f, 0.0f, 1.0f,
                0.0f, 1.0f, 0.0f, 1.0f,

                0.0f, 1.0f, 0.0f, 1.0f, // Prawa ściana
                0.0f, 1.0f, 0.0f, 1.0f,
                0.0f, 1.0f, 0.0f, 1.0f,

                0.0f, 0.0f, 1.0f, 1.0f, // Dolna ściana
                0.0f, 0.0f, 1.0f, 1.0f,
                0.0f, 0.0f, 1.0f, 1.0f,

                0.0f, 0.0f, 1.0f, 1.0f, // Górna ściana
                0.0f, 0.0f, 1.0f, 1.0f,
                0.0f, 0.0f, 1.0f, 1.0f
            };

        public static float[] normals ={
				//Ściana 1
				0.0f, 0.0f,-1.0f,0.0f,
                0.0f, 0.0f,-1.0f,0.0f,
                0.0f, 0.0f,-1.0f,0.0f,

                0.0f, 0.0f,-1.0f,0.0f,
                0.0f, 0.0f,-1.0f,0.0f,
                0.0f, 0.0f,-1.0f,0.0f,

				//Ściana 2
				0.0f, 0.0f, 1.0f,0.0f,
                0.0f, 0.0f, 1.0f,0.0f,
                0.0f, 0.0f, 1.0f,0.0f,

                0.0f, 0.0f, 1.0f,0.0f,
                0.0f, 0.0f, 1.0f,0.0f,
                0.0f, 0.0f, 1.0f,0.0f,

				//Ściana 3
				0.0f,-1.0f, 0.0f,0.0f,
                0.0f,-1.0f, 0.0f,0.0f,
                0.0f,-1.0f, 0.0f,0.0f,

                0.0f,-1.0f, 0.0f,0.0f,
                0.0f,-1.0f, 0.0f,0.0f,
                0.0f,-1.0f, 0.0f,0.0f,

				//Ściana 4
				0.0f, 1.0f, 0.0f,0.0f,
                0.0f, 1.0f, 0.0f,0.0f,
                0.0f, 1.0f, 0.0f,0.0f,

                0.0f, 1.0f, 0.0f,0.0f,
                0.0f, 1.0f, 0.0f,0.0f,
                0.0f, 1.0f, 0.0f,0.0f,

				//Ściana 5
				-1.0f, 0.0f, 0.0f,0.0f,
                -1.0f, 0.0f, 0.0f,0.0f,
                -1.0f, 0.0f, 0.0f,0.0f,

                -1.0f, 0.0f, 0.0f,0.0f,
                -1.0f, 0.0f, 0.0f,0.0f,
                -1.0f, 0.0f, 0.0f,0.0f,

				//Ściana 6
				1.0f, 0.0f, 0.0f,0.0f,
                1.0f, 0.0f, 0.0f,0.0f,
                1.0f, 0.0f, 0.0f,0.0f,

                1.0f, 0.0f, 0.0f,0.0f,
                1.0f, 0.0f, 0.0f,0.0f,
                1.0f, 0.0f, 0.0f,0.0f,


            };

        public static float[] vertexNormals ={
				//Ściana 1
				1.0f,-1.0f,-1.0f,0.0f,
                -1.0f, 1.0f,-1.0f,0.0f,
                -1.0f,-1.0f,-1.0f,0.0f,

                1.0f,-1.0f,-1.0f,0.0f,
                1.0f, 1.0f,-1.0f,0.0f,
                -1.0f, 1.0f,-1.0f,0.0f,

				//Ściana 2
				-1.0f,-1.0f, 1.0f,0.0f,
                1.0f, 1.0f, 1.0f,0.0f,
                1.0f,-1.0f, 1.0f,0.0f,

                -1.0f,-1.0f, 1.0f,0.0f,
                -1.0f, 1.0f, 1.0f,0.0f,
                1.0f, 1.0f, 1.0f,0.0f,


				//Ściana 3
				-1.0f,-1.0f,-1.0f,0.0f,
                1.0f,-1.0f, 1.0f,0.0f,
                1.0f,-1.0f,-1.0f,0.0f,

                -1.0f,-1.0f,-1.0f,0.0f,
                -1.0f,-1.0f, 1.0f,0.0f,
                1.0f,-1.0f, 1.0f,0.0f,

				//Ściana 4
				-1.0f, 1.0f, 1.0f,0.0f,
                1.0f, 1.0f,-1.0f,0.0f,
                1.0f, 1.0f, 1.0f,0.0f,

                -1.0f, 1.0f, 1.0f,0.0f,
                -1.0f, 1.0f,-1.0f,0.0f,
                1.0f, 1.0f,-1.0f,0.0f,

				//Ściana 5
				-1.0f,-1.0f,-1.0f,0.0f,
                -1.0f, 1.0f, 1.0f,0.0f,
                -1.0f,-1.0f, 1.0f,0.0f,

                -1.0f,-1.0f,-1.0f,0.0f,
                -1.0f, 1.0f,-1.0f,0.0f,
                -1.0f, 1.0f, 1.0f,0.0f,

				//Ściana 6
				1.0f,-1.0f, 1.0f,0.0f,
                1.0f, 1.0f,-1.0f,0.0f,
                1.0f,-1.0f,-1.0f,0.0f,

                1.0f,-1.0f, 1.0f,0.0f,
                1.0f, 1.0f, 1.0f,0.0f,
                1.0f, 1.0f,-1.0f,0.0f,
            };

        public static float[] texCoords ={
            // Przednia ściana
            0.0f, 1.0f,
            1.0f, 1.0f,
            1.0f, 0.0f,

            0.0f, 1.0f,
            1.0f, 0.0f,
            0.0f, 0.0f,

            // Tylna ściana
            0.0f, 1.0f,
            1.0f, 1.0f,
            1.0f, 0.0f,

            0.0f, 1.0f,
            1.0f, 0.0f,
            0.0f, 0.0f,

            // Lewa ściana
            0.0f, 1.0f,
            1.0f, 1.0f,
            1.0f, 0.0f,

            0.0f, 1.0f,
            1.0f, 0.0f,
            0.0f, 0.0f,

            // Prawa ściana
            0.0f, 1.0f,
            1.0f, 1.0f,
            1.0f, 0.0f,

            0.0f, 1.0f,
            1.0f, 0.0f,
            0.0f, 0.0f,

            // Dolna ściana
            0.0f, 1.0f,
            1.0f, 1.0f,
            1.0f, 0.0f,

            0.0f, 1.0f,
            1.0f, 0.0f,
            0.0f, 0.0f,

            // Górna ściana
            0.0f, 1.0f,
            1.0f, 1.0f,
            1.0f, 0.0f,

            0.0f, 1.0f,
            1.0f, 0.0f,
            0.0f, 0.0f,
            };



    }
}
